###############################################################################
# This is just an example to show how to configure group Lasso regularization #
###############################################################################

name: "LeNet"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  # All connections are connected
  connectivity_mode: CONNECTED
  param {
    lr_mult: 1
    decay_mult: 1.0
    
    # kernel_shape_decay_mult * kernel_shape_decay = coefficient of group Lasso regularization on columns
    # kernel_shape_decay_mult: 1.0
    
    # breadth_decay_mult * breadth_decay = coefficient of group Lasso regularization on rows
    # breadth_decay_mult: 1.0
    
    block_group_lasso {
      xdimen: 25
      ydimen: 1
      # block_decay_mult * block_group_decay = coefficient of group Lasso regularization on blocks
      block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 20
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  connectivity_mode: CONNECTED
  param {
    lr_mult: 1
    decay_mult: 1.0
    # kernel_shape_decay_mult: 1.0
    # breadth_decay_mult: 1.0
    block_group_lasso {
      xdimen: 50
      ydimen: 1
      block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 50
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "pool2"
  top: "ip1"
  param {
    lr_mult: 1
    decay_mult: 1.0
    #kernel_shape_decay_mult: 1.0
    #breadth_decay_mult: 1.0
    block_group_lasso {
      xdimen: 50
      ydimen: 1
      block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 1.0
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}
layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "ip1"
  top: "ip2"
  param {
    lr_mult: 1
    decay_mult: 1.0
    #kernel_shape_decay_mult: 1.0
    #breadth_decay_mult: 1.0
    block_group_lasso {
      xdimen: 50
      ydimen: 1
      block_decay_mult: 1.0
    }
  }
  param {
    lr_mult: 2
    decay_mult: 1.0
  }
  inner_product_param {
    num_output: 10
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "ip2"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "ip2"
  bottom: "label"
  top: "loss"
}
